require './arcana'
require './logic'

#定数　（カードリスト）

a0 = Arcana.new("愚者", 0,"自由、希望、未来への可能性","現実逃避、焦りや不安、怠慢")
a1 = Arcana.new("魔術師", 1,"創造性、アイディア、始まり","現実逃避、焦りや不安、怠慢")
a2 = Arcana.new("女教皇", 2,"直感的、清純、真実","思い込み、批判的、偏見")
a3 = Arcana.new("女帝", 3,"豊かさ、成功、繁栄","誘惑、浪費、依存心")
a4 = Arcana.new("皇帝", 4,"目標、指導力、決断力","身勝手、独りよがり、不完全燃焼")
a5 = Arcana.new("法王", 5,"伝統、常識、善行","暗転、障害、過ち")
a6 = Arcana.new("恋人達", 6,"新たな始まり、協力、出会い","逃げ、迷い、訪れない")
a7 = Arcana.new("戦車", 7,"冒険心、独立心、探究心","限界、失望、疲労感")
a8 = Arcana.new("力", 8,"努力による結果、存在感、努力","過信、実力不足、試練")
a9 = Arcana.new("隠者", 9,"内省、静かな暮らし、真実を求める","頑固さ、引きこもり、孤独")
a10 = Arcana.new("運命の輪", 10,"予期せぬ幸運、解放、予想外","トラブル、アクシデント、急変")
a11 = Arcana.new("正義", 11,"正義、公平、公正","不安定、判断ミス、バランスが悪い")
a12 = Arcana.new("吊るされた男", 12,"岐路、過渡期、忍耐","閉塞感、本末転倒、困難")
a13 = Arcana.new("死神", 13,"潮時、ターニングポイント、再スタート","欠乏、喪失、無力感")
a14 = Arcana.new("節制", 14,"節度、節約、堅実さ","ミス、過度の要求、トラウマ")
a15 = Arcana.new("悪魔", 15,"破壊、墜落、嫉妬","悪徳、背信、強情")
a16 = Arcana.new("塔", 16,"急激な変化、破綻、魂の成長","混沌、戸惑い、漠然")
a17 = Arcana.new("星", 17,"希望、夢を叶える、インスピレーション","過大評価、誇張、誘惑")
a18 = Arcana.new("月", 18,"悩み、トラウマ、隠し事","欲求、状況の好転、真実")
a19 = Arcana.new("太陽", 19,"潜在的可能性、成果、成長","エネルギー不足、実力が出ない、期待外れ")
a20 = Arcana.new("審判", 20,"復活、回復、変革","失意、幻滅、苦境")
a21 = Arcana.new("世界", 21,"完成、達成、勝利","スランプ、苦渋、絶望感")


#実行処理開始

puts "タロット占い館へようこそ"
scene = "start"

while true
    case scene
        when "start"
            puts "占いの方法、または終了を選んで下さい"
            puts "⒈ワンオラクル"
            puts "⒉プログラムを終了する"
            sn = gets.to_i
            case sn
                when 1
                i = rand(21)
                spread1(list[i])
                when 2
                puts "プログラムを終了します"
                puts "少しお待ちください"
                sleep 2
                exit
            else
                puts "ちゃんと選択してください"
                scene = "start"
            end
    end
end














